git/Credential.org
#+TITLE: Credential
#+DATE: 2018-05-25

* Credential 이란?
git으로 clone하거나(private 저장소의 경우) pull, push 등을 할 때, ssh 혹은 https 인증을 사용합니다.
ssh의 경우 ssh-keygen으로 생성된 공개키를 이용해서 username, password 입력 없이 로그인 할 수 있지만, 
https의 경우 그럴 수가 없기 때문에 호스트 PC의 메모리나 캐쉬에 username과 password를 저장해서
사용자 인증 없이 바로 git 리모트저장소를 사용할 수 있도록 해줍니다.

* Credential 정보 가져오기
#+BEGIN_SRC sh
$ git credential fill
#+END_SRC

* Credential 정보 삭제하기(GitLab 사용 시, MacOS 환경)
#+BEGIN_SRC sh=
$ git credential-osxkeychain erase
host=gitlab.com
protocol=htps
<return>
#+END_SRC

위의 방식으로 하고 credential 정보를 가져오면 username과 password가 제거된 것을 확인할 수 있습니다.
