gh-pages/git/Credential.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Credential</title>
<!-- 2018-09-18 Tue 07:03 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
</head>
<body>
<div id="content">
<h1 class="title">Credential</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Credential 이란?</a></li>
<li><a href="#sec-2">2. Credential 정보 가져오기</a></li>
<li><a href="#sec-3">3. Credential 정보 삭제하기(GitLab 사용 시, MacOS 환경)</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Credential 이란?</h2>
<div class="outline-text-2" id="text-1">
<p>
git으로 clone하거나(private 저장소의 경우) pull, push 등을 할 때, ssh 혹은 https 인증을 사용합니다.
ssh의 경우 ssh-keygen으로 생성된 공개키를 이용해서 username, password 입력 없이 로그인 할 수 있지만, 
https의 경우 그럴 수가 없기 때문에 호스트 PC의 메모리나 캐쉬에 username과 password를 저장해서
사용자 인증 없이 바로 git 리모트저장소를 사용할 수 있도록 해줍니다.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Credential 정보 가져오기</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-sh">$ git credential fill
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Credential 정보 삭제하기(GitLab 사용 시, MacOS 환경)</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-sh=">$ git credential-osxkeychain erase
host=gitlab.com
protocol=htps
&lt;return&gt;
</pre>
</div>

<p>
위의 방식으로 하고 credential 정보를 가져오면 username과 password가 제거된 것을 확인할 수 있습니다.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-05-25</p>
<p class="author">Author: root</p>
<p class="date">Created: 2018-09-18 Tue 07:03</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
